{
  "@@locale": "ar",
  "loginscreen": {
    "email":"البريد الإلكتروني",
    "password": "كلمة المرور",
    "forgetyourpassword": "نسيت كلمة المرور؟",
    "login": "تسجيل الدخول",
    "youdonothaveanaccount": "ليس لديك حساب؟",
    "registerasuser": "تسجيل كمستخدم",
    "registerasconsultant": "تسجيل كمستشار",
    "registernow": "سجل الآن"
  },

  "resetpasswordscreen": {
    "resetpassword": "إعادة تعيين كلمة المرور",
    "writeyouremailtoresetpassword": "أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور",
    "send": "إرسال",
    "backtologinscreen": "عودة إلى تسجيل الدخول"
  },

  "signup": {
    "registeranewuser": "تسجيل مستخدم جديد",
    "fullname": "الاسم الكامل",
    "confirmpassword": "تأكيد كلمة المرور",
    "youalreadyhaveanaccount": "لديك حساب بالفعل؟",
    "registration": "تسجيل"
  },

  "homepage": {
    "rafq": "رفق",
    "weareheretosupportyou": "...نحن هنا لدعمك",
    "drawyourfeeling": "ارسم مشاعرك",
    "ForumsandCommunities ": "المنتديات والمجتمعات",
    "Resourcesandarticles": "الموارد والمقالات",
    "PsychologicalTestsSection": "الاختبارات النفسية",
    "Reportsandpersonalprogress": "التقارير والتقدم الشخصي",
    "signout": "تسجيل الخروج",
    "settings": "الإعدادات",
    "hello": "مرحبا",
    "Findthelightinthedark": "ابحث عن الضوء في الظلام",
    "CounselingSessions": "جلسات استشارية",
    "exercisesandstrategies": "تمارين واستراتيجيات",
    "educationalresources": "موارد تعليمية",
    "supportgroups": "مجموعات دعم",
    "moodtracking": "تتبع المزاج",
    "Noadress": "لا عنوان",
    "Therearenomessagesyet.": "لا رسالة",
    "areyousure?": "هل أنت متأكد؟",
    "doyouwanttosignoutfromapplication?": "هل ترغب في تسجيل الخروج من التطبيق؟",
    "no": "لا",
    "yes": "نعم"
  },

  "drawingpage": {
    "choosethecolor": "اختيار اللون",
    "cancel": "إلغاء",
    "done": "تم",
    "Unabletocaptureimagefromtheboard": "تعذر التقاط الصورة من اللوحة",
    "Thedrawinghasbeensavedwithintheapplication!": "تم حفظ الرسم داخل التطبيق!",
    "Anerroroccurredwhilesavingthedrawing!Tryagain.": "حدث خطأ أثناء حفظ الرسم! حاول مرة أخرى.",
    "Thedrawinghasbeensuccessfullydeleted!": "تم حذف الرسم بنجاح!",
    "Couldnotdeletedrawing!Tryagain.": "تعذر حذف الرسم! حاول مرة أخرى.",
    "Savethedrawing": "حفظ الرسم",
    "Saveddrawing": "تم حفظ الرسم "
  },

  "forumpage": {
    "anxiety": "القلق",
    "depression": "الاكتئاب",
    "Therearenoforums": "لا توجد منتديات متاحة حاليًا.",
    "Noavaliableadress": "عنوان غير متوفر",
    "Thereisnodetails": "لا توجد تفاصيل",
    "makewrongwhenupdatethelikes": "حدث خطأ أثناء تحديث الإعجابات",
    "chatwithmembers": "الدردشة مع الأعضاء",
    "Descriptionofthetopic": "تفاصيل المنتدى",
    "": "لم يتم العثور على المنتدى",
    "addsharing": "إضافة مشاركة",
    "Thereisnoanysharing": "لا توجد مشاركات حالياً.",
    "deletedsharingsuccessfully": "تم حذف المشاركة بنجاح",
    "Anerroroccurredwhiledeletingthepost.": "حدث خطأ أثناء حذف المشاركة",
    "Postsuccessfullyposted!": "تم نشر المشاركة بنجاح!",
    "Theadress": "العنوان",
    "Thecontent": "المحتوى",
    "addthesharing": "إضافة المشاركة",
    "Thechat": "الدردشة",
    "Thereisnomessageyet": "لا توجد رسائل بعد.",
    "sendamessage": "أرسل رسالة..."
  },

  "goaldetailpage": {
    "Practicemeditationfor10minutesdaily.": "ممارسة التأمل لمدة 10 دقائق يوميًا",
    "Readabookaweek": "قراءة كتاب أسبوعيًا",
    "Writingyourfeelingsinyourjournal": "كتابة مشاعرك في دفتر يومياتك",
    "Conductaweeklypsychologicalsupportsession": "إجراء جلسة دعم نفسي أسبوعيًا",
    "Exercise3timesaweek": "ممارسة الرياضة 3 مرات في الأسبوع",
    "Setaside10minuteseachdayforbreathingormindfulnessmeditation..": "تخصيص وقت كل يوم لمدة 10 دقائق لتأمل التنفس أو التأمل الذهني.",
    "Take10minutesadaytowritedownyourfeelingsandthoughtsinajournal.Thishabitcanhelpimproveyourmentalhealth..": "خصص 10 دقائق يوميًا لكتابة مشاعرك وأفكارك في دفتر يومياتك. يمكن أن تساعد هذه العادة في تحسين صحتك النفسية.",
    "Chooseabookandreadatleastonechapterperweektodeveloppersonalskills": "اختيار كتاب وقراءة فصل واحد على الأقل أسبوعيًا لتطوير المهارات الشخصية.",
    "Doexercisessuchaswalkingorjoggingfor30minutesatatime.": "القيام بتدريبات رياضية مثل المشي أو الركض لمدة 30 دقيقة في كل مرة.",
    "Trackyourprogressandstayontrack!": "تابع تقدمك وابق على المسار الصحيح!",
    "Takeadeepbreath,closeyoureyes,andfocusonyourbreathingfor10minutes.YoucanuseappslikeHeadspaceorCalm.": "خذ نفسًا عميقًا، إغلق عينيك، وركز على تنفسك لمدة 10 دقائق. يمكنك استخدام تطبيقات مثل Headspace أو Calm.",
    "Writedowneverythingthatcomestomindinyourjournal,evenifyouthoughtsseemrandom.Thiswillhelyouregulateyouremotionsandreducestress.": "اكتب كل ما يخطر ببالك في دفتر يومياتك، حتى لو كانت أفكارك عشوائية. سيساعدك ذلك على تنظيم مشاعرك وتقليل التوتر.",
    "Chooseabookthatinterestsyouandstartbyreadingonechapter.Trytosetasidetimeeachdayforthis.": "اختر كتابًا يثير اهتمامك وابدأ بقراءة فصل واحد. حاول أن تخصص وقتًا يوميًا لذلك.",
    "Startwithaneasyrunorwalkfor5minutes,thengraduallyincreasethetimeeachweek.": "ابدأ بالجري السهل أو المشي لمدة 5 دقائق، ثم زد الوقت تدريجيًا كل أسبوع.",
    "Youhavecompletedthegoal!": "لقد أكملت الهدف!",
    "Howtodothegoal:": "كيفية القيام بالهدف:",
    "Yourprogress:": "تقدمك:",
    "Completethegoal": "أكمل الهدف",
    "Currentstep:": "الخطوة الحالية"
  },

  "logoutpage": {
    "signout": "تسجيل الخروج",
    "confirmlogout": "تأكيد تسجيل الخروج",
    "Areyousurethatyouwanttologout?": "هل أنت متأكد أنك تريد تسجيل الخروج؟",
    "Anerroroccurredwhileloggingout": "حدث خطأ أثناء تسجيل الخروج:"
  },

  "notificationsettingspage": {
    "customizenotifications": "تخصيص الإشعارات",
    "messagenotifications": "إشعارات الرسائل",
    "activitynotifications": "إشعارات الأنشطة"
  },

  "privacypolicypage": {
   "privacyploicy": "سياسة الخصوصية",
   "intoduction": "مقدمة:",
    "Ourappiscommittedtoprotectinguserprivacy.Somedataiscollectedtoimproveyourexperienceandprovidepersonalizedservices.": "تطبيقنا يلتزم بحماية خصوصية المستخدمين. يتم جمع بعض البيانات لتحسين تجربتك وتقديم خدمات مخصصة.",
    "datawecollect": "البيانات التي نقوم بجمعها:",
    "Wecollectpersonaldatasuchasname,email,locationdata,andsomedatarelatedtotheuseoftheapplicationtoimproveperformance.": "نقوم بجمع بيانات شخصية مثل الاسم، البريد الإلكتروني، بيانات الموقع، وبعض البيانات المتعلقة باستخدام التطبيق لتحسين الأداء.",
    "Howweuseyourdata": "كيف نستخدم بياناتك:",
    "Weusedatatoimproveperformance,sendimportantnotificationstotheuser,andprovideservicestailoredtotheuser'sneeds.": "نستخدم البيانات لتحسين الأداء، إرسال إشعارات هامة للمستخدم، وتقديم خدمات مخصصة وفقًا لاحتياجات المستخدم.",
    "sharingdatawiththirdparties": "مشاركة البيانات مع أطراف ثالثة:",
    "Wedonotsharedatawiththirdpartiesunlessnecessary,suchaspartnersoranalyticsservices.": "نحن لا نشارك البيانات مع أطراف ثالثة إلا في حال كانت هناك ضرورة لذلك مثل الشركاء أو خدمات التحليلات المساعدة.",
    "Savedata": "حماية البيانات:",
    "Wetakeallnecessarysecuritymeasuressuchasencryptiontoprotectuserdata.": "نحن نتخذ جميع التدابير الأمنية اللازمة مثل التشفير لحماية بيانات المستخدمين.",
    "Userrights": "حقوق المستخدمين:",
    "Usershavetherighttoaccess,update,ordeletetheirdatathroughSettings.Theycanalsosubmitprivacyrequestssuchasdeletingtheiraccountoroptingoutofdatacollection.": "يحق للمستخدمين الوصول إلى بياناتهم وتحديثها أو حذفها من خلال الإعدادات. يمكنهم أيضًا تقديم طلبات خصوصية مثل حذف الحساب أو الانسحاب من جمع البيانات.",
    "Cookies": "الكوكيز :",
    "Weusecookiestoenhanceuserexperience,suchasstoringlanguagepreferencesandmore.Userscanmanagetheircookiepreferencesthroughtheirbrowsersettings.": "نستخدم تقنيات الكوكيز لتحسين تجربة المستخدم، مثل حفظ تفضيلات اللغة وغيرها. يمكن للمستخدمين إدارة تفضيلات الكوكيز عبر إعدادات المتصفح.",
    "Changestotheprivacyploicy": "تغييرات في سياسة الخصوصية:",
    "ThisPrivacyPolicywillbeupdatedfromtimetotime,anduserswillbenotifiedofanychangestothispolicy.": "سيتم تحديث سياسة الخصوصية من وقت لآخر، وسيتم إعلام المستخدمين بأي تغييرات تطرأ على هذه السياسة.",
    "ContactInformation": "معلومات الاتصال:",
    "Foranyinquiriesabouttheprivacypolicy,userscancontactthesupportteamviaemail:support@example.com": "لأي استفسارات حول سياسة الخصوصية، يمكن للمستخدمين التواصل مع فريق الدعم عبر البريد الإلكتروني: support@example.com"
  },

  "Resourcespage": {
    "AnxietyandStress": "القلق والتوتر",
    "Depression": "الاكتئاب",
    "SleepDisorders": "اضطرابات النوم",
    "StressManagement": "إدارة الضغوط",
    "SocialRelationships": "العلاقات الاجتماعية",
    "Self-EsteemandSelf-Confidence": "تقدير الذات والثقة بالنفس",
    "MentalHealthofChildrenandAdolescents": "الصحة النفسية للأطفال والمراهقين",
    "MentalHealthoftheElderly": "الصحة النفسية لكبار السن",
    "TraumaandRecovery": "الصدمات النفسية والتعافي منها",
    "NutritionandMentalHealth": "التغذية والصحة النفسية",
    "Mindfulness,Meditation,Relaxation": "اليقظة الذهنية، التأمل، الاسترخاء",
    "HowtoDealwithAnxiety": "كيفية التعامل مع القلق",
    "PracticalTipsforDealingwithAnxietyandDailStress.": "نصائح عملية للتعامل مع القلق والتوتر اليومي.",
    "TheImportanceofGoodSleeforMentalHealth": "أهمية النوم الجيد للصحة النفسية",
    "HowGoodSleepAffectsOuMentalHealth.": "كيف يؤثر النوم الجيد على صحتنا النفسية.",
    "1.Practicepositivethinking'2.Usejournalingtoreleaseyourfeelings3.Tryrationality4.Calmthenervoussystemusingdiaphragmaticbreathing(deepbreathing)5.Overcomefearbygentlytalkingyourselfoutofit.": "'1. تدرب على التفكير الإيجابي\\n'\n          '2. استخدم التدوين لإخراج مشاعرك\\n'\n          '3. جرب العقلانية\\n'\n          '4. تهدئة الجهاز العصبي باستخدام التنفس الحجابي (التنفس العميق).\\n'\n          '5. تغلبْ على الخوف من خلال التحدث بلطف إلى نفسك للخروج من هذه الحالة.'",
    "'*Hoursofsleepareveryimportantinthelifeofanyhumanbeingfromthemomentofbirth.In fact,sleepisessentialforthepropergrowthanddevelopmentofchildrenandinfantsandtheirphysicalandpsychologicaldevelopment.**Inadults,thequalityofsleepdirectlyaffectstheirnormalactivities,asrestandmusclerelaxationoccurduringsleep,andbreathingratedecreases.Furthermore,sleepislinkedtomood,withpsychologicaldisorderssuchasanxietyordepressionbeingmorecommoninpeoplewithpoorsleepquality.*Sleepisinfluencedbytwomainhormones:cortisolandmelatonin.Theformeristhestresshormoneandisconcentratedinthebloodduringtheearlymorninghours,makingpeoplefeelalert.However,melatoninisthesleephormoneanditsconcentrationincreasesatnight,makingpeoplefeelrelaxed.Thishormonalbalanceisessentialforpeopletogetgoodsleep.": "'* لساعات النوم أهمية كبيرة في حياة أي إنسان منذ لحظة ولادته. في الواقع، يعد النوم ضروريًا لنمو الأطفال والرضع بشكل صحيح ونموهم الجسدي والنفسي.\\n '\n          '* لدى البالغين، تؤثر نوعية النوم بشكل مباشر على أنشطتهم المعتادة، حيث تحدث الراحة واسترخاء العضلات خلال ساعات النوم.، ويقلل من معدل التنفس. علاوة على ذلك، يرتبط النوم بالمزاج، مع ملاحظة أن الاضطرابات النفسية مثل القلق أو الاكتئاب تكون أكثر شيوعًا لدى الأشخاص الذين يعانون من ضعف نوعية النوم.\\n'\n      '* يتأثر النوم بهرمونين رئيسيين: الكورتيزول والميلاتونين.. الأول هو هرمون التوتر، ويتركز في الدم خلال الساعات الأولى من الصباح، مما يجعل الإنسان نشيطاً. إلا أن الميلاتونين هو هرمون النوم، ويزداد التركيز عند حلول الليل، مما يجعل الإنسان في حالة من الاسترخاء. هذا التوازن في الهرمونات ضروري للناس للحصول على نوم جيد.\\n'",
    "ArticleCategories": "تصنيفات المقالات",
    "RecommendedArticles": "المقالات الموصى بها",
    "anxietyAndStress": "القلق والتوتر هما من أكثر الحالات النفسية شيوعًا. يمكن أن يحدث القلق بسبب الخوف من المستقبل أو مواقف غير معروفة. أما التوتر فيحدث بسبب ضغوط الحياة اليومية. من المهم تعلم تقنيات الاسترخاء مثل التنفس العميق، اليوغا، أو التأمل لتقليل الأعراض.\n\n يعد التوتر جزء طبيعي من الحياة، وقد يكون ناتجاً عن عوامل بيئية أو جسمية أو فكرية. ولا يشترط أن يكون التوتر أمر سلبي، بل إن التغيرات الإيجابية في الحياة مثل الحصول على ترقية، أو ولادة الطفل قد تؤدي إلى حدوث التوتر النفسي.\n\n تنتج اضطرابات القلق، مثل سائر حالات الصحة النفسية، عن تفاعل معقَّد بين عوامل اجتماعية ونفسية وبيولوجية. ويمكن لأي شخص أن يُصَاب بأحد أنواع اضطرابات القلق، لكن الأشخاص الذين مروا بتجارب من سوء المعاملة أو الخسائر الفادحة أو غيرها من التجارب السلبية يكونون أكثر عرضة للإصابة بأحد هذه الاضطرابات.\n\n يمكن أن تؤدي الرعاية الذاتية دوراً مهماً في العلاج الداعم. ولكي يكون لك دور مساعد في التدبير العلاجي لأعراض القلق لديك وتحسين سلامتك النفسية عموماً، يمكنك اتباع ما يأتي:\n\n * تجنب الكحول أو التقليل منه، وعدم تعاطي المخدرات غير المشروعة التي قد تؤدي إلى تفاقم الشعور بالقلق;\n * ممارسة الرياضة بانتظام، حتى لو كان ذلك مجرد المشي مسافة قصيرة;\n * اكتساب عادة التأمل عن طريق اليقظة الذهنية، حتى لو كان ذلك لبضع دقائق يوماً.",
    "depression": "الاكتئاب هو حالة نفسية تتميز بالحزن العميق وفقدان الاهتمام بالأشياء. قد يؤدي الاكتئاب إلى تدهور الأداء اليومي وصعوبة التفاعل مع البيئة المحيطة. العلاج يتضمن العلاج النفسي، الأدوية، وتغيير نمط الحياة مثل ممارسة الرياضة والنوم الجيد.\n\n يعاني المكتئب خلال نوبة الاكتئاب من تكدّر المزاج (الشعور بالحزن وسرعة الغضب والفراغ). وقد يشعر بفقدان الاستمتاع أو الاهتمام بالأنشطة.\n\n وتختلف نوبة الاكتئاب عن تقلبات المزاج المعتادة. وتستمر معظم اليوم، وتحدث كل يوم تقريباً، لمدة أسبوعين على الأقل.\n\n وهناك أيضاً أعراض أخرى للاكتئاب، منها ما يلي:\n\n 1. ضعف التركيز\n 2. الإفراط في الشعور بالذنب أو ضعف تقدير الذات\n 3. تقلبات الشهية أو الوزن\n\n * من شأن الرعاية الذاتية أن تؤدي دوراً مهماً في معالجة أعراض الاكتئاب وأن تُعزّز العافية في العموم، هذا ما يمكننا فعله:\n\n * حاول أن تستمر في الأنشطة التي اعتدت أن تستمتع بها\n * التزم بعادات الأكل والنوم المنتظمة قدر الإمكان\n * تحدث إلى شخص تثق به عن مشاعرك",
    "sleep_disorders": "اضطرابات النوم هي مشكلة تؤثر على جودة النوم. تشمل الأعراض صعوبة النوم أو الاستيقاظ المتكرر أثناء الليل. لعلاج اضطرابات النوم يجب اتباع نظام نوم منتظم، تجنب المنبهات قبل النوم، والابتعاد عن الشاشات في الليل.\n\nاضطراب النوم يمكنه التأثير في صحتك العامة وسلامتك وجودة حياتك. يمكن أن يؤثر عدم الحصول على قدرٍ كافٍ من النوم ليلاً في قدرتك على القيادة أو العمل بأمان. كما قد يزيد من خطر إصابتك بمشكلات صحية أخرى. لكن يمكن أن يساعدك العلاج على الحصول على قسط النوم الذي تحتاج إليه.\n\nتتضمن أعراض اضطرابات النوم الشائعة ما يأتي:\n\n1. الشعور بالنعاس الشديد خلال ساعات النهار. قد تنام في أوقات ليست طبيعية، مثل أثناء القيادة أو أثناء العمل على مكتبك.\n\n2. التنفس بطريقة غير طبيعية. قد يشمل ذلك الغطيط، أو الشخير، أو الشهيق، أو الاختناق، أو توقف التنفس مؤقتًا.\n\n3. الحركة كثيرًا أو فعل بحركات تزعجك أثناء النوم، مثل حركة الذراعين والساقين أو صرير الأسنان.\n\nالحالات التي تستلزم استشارة الطبيب:\n\nيمكن أن يمر أي شخص بليلة لا ينام فيها بشكل جيد من حين إلى آخر. ولكن تحدث إلى الطبيب أو اختصاصي الرعاية الصحية إذا كنت تواجه صعوبة مستمرة في الحصول على قسط كافٍ من النوم، أو إذا لم تشعر بالراحة عند الاستيقاظ، أو إذا كنت تشعر بالنعاس المفرط خلال النهار.",
    "stress_management": "إدارة الضغوط هي مهارة أساسية للحفاظ على الصحة النفسية. تقنيات مثل التنفس العميق، ممارسة الرياضة، تخصيص وقت للاسترخاء، وتنظيم الوقت يمكن أن تساعد في تقليل الضغوط اليومية وتحسين الحالة النفسية.\n\nأول علامات الضغط النفسي هي:\n\n1. الانفعالية\n2. مشاكل النوم\n\nنصائح للتخلص من الضغوطات النفسية عبر المساعدة الذاتية\n\nالفترات القصيرة من التوتر تعد طبيعية وغالبًا ما يمكن حلها من خلال شيء بسيط، مثل استكمال مهمة (وبالتالي الحد من عبء العمل)، أو من خلال التحدث إلى الآخرين وأخذ الوقت للاسترخاء. واحد أو أكثر من الاقتراحات التالية قد يساعد:\n\n• قم بتقييم ما في حياتك بالضبط لتعرف مصدر قلقك. فعلى سبيل المثال، هل أنت قلق بشأن الامتحانات أم المال أم المشاكل المتعلقة بالعلاقات؟ انظر ما إن كان يمكنك تغيير ظروفك لتخفيف الضغط عن نفسك.\n\n• تعلم الاسترخاء. إذا أصبت بنوبة هلع أو بضغط نفسي، فحاول التركيز على شيء خارج نفسك، أو قم بمشاهدة التلفزيون أو التحدث إلى شخص ما. قد يساعد الاسترخاء وتمارين التنفس في ذلك.\n\n• حاول حل المشاكل الشخصية من خلال التحدث إلى أحد الأصدقاء أو أستاذك أو أحد أفراد عائلتك.",
    "Goodsocialrelationships": " 'العلاقات الاجتماعية الجيدة ضرورية للصحة النفسية. تعزيز العلاقات مع الأصدقاء والعائلة، والتواصل المفتوح، ودعم الآخرين يمكن أن يقلل من التوتر ويعزز من الشعور بالانتماء.\\n'\n                   ':العلاقات الاجتماعية الجيّدة لها العديد من الفوائد، ونذكر منها ما يأتي'\n                    '1.تقليل خطر الإصابة بالقلق والاكتئاب \\n'\n                    '2. تعزيز احتراك النفس.\\n'\n                    '3. تحسين النعاطف بين الافراد\\n'\n                    '4. تعزيز الثقه والعلاقات التعاونيه\\n',",
    "Self-esteemandself-confidence": "'تقدير الذات والثقة بالنفس هما الأساس للنجاح الشخصي والصحة النفسية. بناء الثقة بالنفس يتطلب العمل على تقوية مهارات الفرد، التفكير الإيجابي، والاعتناء بالنفس. \\n'\n                      'للثقة بالنفس وتقدير الذات أهميّة كبيرة في حياة الفرد النفسيّة والاجتماعية، وذُكرت هذه الأهمية على النحو الآتي \\n'\n                       '* تحقيق التوافق النفسي \\n'\n                        '* اكتساب الخبرات \\n'\n                        '* النجاح في العمل \\n'\n                        '* محبه المجتمع \\n'\n                        '* مواجهه المشكلات \\n'\n                        'التقة بالنفس وتقدير الذات هما من أهم السمات الشخصية التي يجب أن يتمتّع بها الفرد، فهما الطريق للنجاح الذاتي، وتحقيق التوافق الاجتماعي، إلا أنّها توجد الكثير من المعوقات التي من شأنها أن تؤثّر على مُعدّل ثقة الفرد بنفسه وتقديرها، منها \\n'\n                         '* المعوقات الصحيه \\n'\n                         '* المعوقات الوجدانيه \\n'\n                         '* المعوقات العقليه \\n'\n                         '* المعوقات الاقتصاديه \\n',",
    "Thementalhealthofchildrenandadolescents\"stress_management\":": " 'الصحة النفسية للأطفال والمراهقين تتطلب اهتمامًا خاصًا. من المهم خلق بيئة آمنة وداعمة لهم، وتوفير وسائل تعليمية للتعامل مع مشاعرهم. العلاج قد يشمل الدعم النفسي والتوجيه الأسري.'\n                    'التمتع بالصحة النفسية الجيدة يعتبر من أهم أسباب النمو الصحي والإتزان لدى جميع الأطفال، وسلامتهم النفسية هي ما يحتاجونه لبناء علاقات جيدة مع الآخرين، ويكون لها الدور الأكبر في قدرتهم على التعامل مع التحديات التي تواجههم، وتتبين أهميتها في بعض الجوانب نذكر منها:\\n'\n                      '1. تشعرهم بالرضا تجاه أنفسهم، وتزيد من الثقة بالنفس.\\n'\n    '2. تمكنهم من الاستمتاع بحياتهم، وتقلل من الطاقة السلبية.\\n'\n    '3. تساعدهم على التعلم، وتنمي حس الإبداع لديهم.\\n'\n    '4. تقوي روابطهم الأسرية، وتبني علاقاتهم بشكل سليم.\\n'\n    '5. تحسن طريقة تعاملهم مع المشاعر الحزينة، وتقلل من التوتر.\\n'\n    '6. تعزز قدرتهم على التعافي من الأوقات الصعبة، واسترجاع ذاتهم.\\n'\n    '7. تزيد من حبهم لتجربة أشياء جديدة، وتزيد من قدرتهم على فهم ما يجري حولهم.',",
    "Thementalhealthofolderpeople\"stress_management\":": "'الصحة النفسية لكبار السن تحتاج إلى رعاية خاصة. يعاني بعض كبار السن من الوحدة، الاكتئاب، أو القلق. الدعم الاجتماعي، الأنشطة الموجهة، والاهتمام الطبي يمكن أن يحسن من صحتهم النفسية.'\n                  'تركز استراتيجيات تعزيز الصحة النفسية والوقاية لكبار السن على دعم التمتع بالصحة في مرحلة الشيخوخة. ويعني ذلك تهيئة البيئات المادية والاجتماعية التي تدعم الرفاه وتمكن الأشخاص من القيام بالمهام التي يرون أهميتها، على الرغم من تراجع قدراتهم.\\n'\n                  'وتشمل الاستراتيجيات الرئيسية لتعزيز الصحة النفسية والوقاية من أجل التمتع بالصحة في مرحلة الشيخوخة، ما يلي:\\n'\n                   '1. تدابير الحد من انعدام الأمن المالي وعدم المساواة في الدخل.\\n'\n    '2. البرامج المعنية بضمان تهيئة المساكن والمباني العامة ووسائل النقل المأمونة والتي يسهل الوصول إليها.\\n'\n    '3. الدعم الاجتماعي لكبار السن وللقائمين على رعايتهم.\\n'\n    '4. دعم السلوكيات الصحية، ولاسيما اتباع النظام الغذائي المتوازن، وممارسة النشاط البدني، والامتناع عن تعاطي التبغ، والحد من تعاطي الكحول.\\n'\n    '5. البرامج الصحية والاجتماعية التي تستهدف الفئات الضعيفة مثل أولئك الذين يعيشون بمفردهم أو في المناطق النائية وأولئك الذين يعانون من الحالات الصحية المزمنة.'\n     'يكتسي التعرّف السريع على حالات الصحة النفسية وعلاجها (وما يرتبط بها من حالات عصبية وحالات تعاطي المخدرات) لدى كبار السن أهمية أساسية. وينبغي أن تُتّبع في ذلك معايير الرعاية المتكاملة للمسنين، التي تستند إلى المجتمع المحلي وتركز على الرعاية الطويلة الأجل لكبار السن المصابين بحالات الصحة النفسية وتراجع القدرات الأساسية، وعلى توعية مقدمي الرعاية وتدريبهم ودعمهم، سواءً بسواء. وعادة ما يوصى بمزيج من التدخلات الخاصة بالصحة النفسية وسائر أشكال الدعم من أجل تلبية الاحتياجات الصحية والشخصية والاجتماعية للأفراد',",
    "Psychologicaltraumacangreatlyaffectaperson.Itcanincludetraumafromthepastordifficultsituations.Treatmentandrecoveryfromtraumarequiresongoingpsychologicalsupportandguidancetodealwithnegativefeelings throughpsychotherapy.'Whenpeopleexperiencetrauma,theyareoverwhelmedbyfeelingsofsadness,anger,andperhapsdenialandself-blame.Overtime,manypeoplecanadaptandovercomethenegativeeffects,especiallywiththenecessarysupportWhilesymptomsmaypersistinsomecases,thepersonmayfeelstuckinthisevent,constantlyrelivingthepainfulexperienceandthenegativefeelingsthataccompanyit.Theymayalsoavoidanythingorplacethat mightremindthemofit,whichindicatesthepossibilityofdevelopingapsychologicaldisordercalledpost-traumaticstressdisorder.'Typesofpsychologicaltraumaincludethefollowing:'1.Acutetrauma'2.Chronictrauma'3.Complextrauma'4.Secondarytrauma'TreatmentofpsychologicaltraumadependsonSymptomsthepatientissufferingfrom,andaimstoreducetheimpactofthetraumaontheperson,andtreattheconditionsresultingfromit,suchasanxiety,depression,orpost-traumaticstressdisorder.'Psychotherapyisthefirststepintreatingcasesofpsychologicaltrauma,andthetreatmentmethodsusedincludethefollowing:'*Cognitivebehavioraltherapy'*Eyemovementdesensitizationandreprocessing \\n": "'الصدمات النفسية يمكن أن تؤثر بشكل كبير على الشخص. يمكن أن تشمل صدمات من الماضي أو مواقف صعبة. العلاج والتعافي من الصدمات يتطلب دعم نفسي مستمر، وتوجيه للتعامل مع المشاعر السلبية من خلال العلاج النفسي. \\n'\n                  'يسيطر على الأشخاص عند تعرضهم لصدمة ما شعور بالحزن، والغضب، وربما الإنكار ولوم النفس، وبمرور الوقت يستطيع العديد من الأشخاص التأقلم والتغلب على الآثار السلبية خاصة مع تلقي الدعم اللازم. بينما قد تستمر الأعراض في بعض الحالات فيشعر الشخص بأنه عالق في هذا الحدث فيظل يسترجع أحداث التجربة المؤلمة وما يصاحبها من مشاعر سلبية، كما يحرص على تجنب أي شيء أو مكان قد يذكره بذلك، وهو ما يشير إلى احتمالية الإصابة باضطراب نفسي يطلق عليه اضطراب ما بعد الصدمة\\n'\n                  'تشمل أنواع الصدمة النفسية ما يلي \\n'\n                  '1. الصدمه الحاده\\n'\n                  '2. الصدمه المزمنه\\n'\n                  '3. الصدمه المعقده \\n'\n                  '4. الصدمه الثانويه \\n'\n                  'يعتمد علاج الصدمة النفسية على الأعراض التي يعاني منها المريض، ويهدف إلى تخفيف وقع الصدمة على الشخص، وعلاج الحالات التي تنجم عنها، مثل القلق والاكتئاب، أو اضطراب ما بعد الصدمة. \\n'\n                   'يعد العلاج النفسي هو الخطوة الأولى في معالجة حالات الصدمة النفسية، وتشمل أساليب العلاج المتبعة ما يلي: \\n'\n                   '* العلاج السلوكي المعرفي \\n'\n                   '* ازاله التحسس واعاده المعالجه عن طريق حركه العين \\n',",
    "Goodnutritionplaysafundamentalroleinmentalhealth.Eatingabalanceddiethelpsimprovemoodandtheabilitytocopewithstress.Foodsrichinomega-3,vitamins,andnutrientscansupportmentalhealth.Regardingphysicalactivityanditsrelationshiptomentalhealth,Hilalsaid:Exerciseisanimportanthealthyhabitthatenhancesthesecretionofhappinesshormonesinthebody.Ifapersongetsusedtoexerciseandmakesitalifestyle,ithelpsthemregulateeatingandgivesthemasenseofsatisfactionandaccomplishment.Numerousstudieshaveindicatedthatregularexercisemayhelppeoplewithdepressionreducetheirmedicationdoses.Teamsportssuchasfootballareverybeneficialforchildren,astheyenhancetheirself-confidenceandself-esteem,andhelpbuildtheirpersonalities.SpecialistNadineHilalpointedoutthatthereare20typesofhappinesshormones,andendorphinsarethemostfamousamongthem,astheyinclude5hormones:dopamine,serotonin,oxytocin,estrogen,andprogesterone.AllofthesehormonesgiveasenseofHappiness.Manyfoodscanboostthesecretionofthesehormones,includingchocolate,coffee,sugars,andfastfood.However,werecommendeatinghealthyfoodstoboostthesehormones,suchashealthysugarsfoundinfruitsandlow-sugardarkchocolate.Exercisealsoimprovesmoodandstimulateshappinesshormones.Therearestudiesindicatingthatmusicalsocontributestothesecretionofthesehormones.Today,therearemedicalcentersthattreatcancerpatientswitmusictoimprovetheirmood.": " 'التغذية الجيدة تلعب دورًا أساسيًا في الصحة النفسية. تناول طعام متوازن يساعد في تحسين المزاج والقدرة على التعامل مع التوتر. الأطعمة الغنية بالأوميجا 3، الفيتامينات، والمغذيات يمكن أن تدعم الصحة العقلية.\\n'\n                      'وفيما يخص النشاط البدني وعلاقته بالصحة النفسية، قالت هلال: الرياضة عادة صحية مهمة تعزز من إفراز هرمونات السعادة في الجسم، وفي حال اعتاد الشخص على الرياضة وجعلها أسلوب حياة، فإنها تساعده على تنظيم الطعام وتمنحه شعوراً بالرضا والإنجاز، كما أشارت دراسات عديدة إلى أن الممارسة الدورية للرياضة قد تساعد الأشخاص المصابين بالاكتئاب في تقليل جرعاتهم الدوائية، ثم إن الرياضات الجماعية مثل كرة القدم مفيدة جداً للأطفال، إذ تعزز من ثقتهم بأنفسهم وتقديرهم لذواتهم، وتساعد في بناء شخصيتهم. \\n'\n                      'أشارت الاختصاصية نادين هلال إلى أنه يوجد 20 نوعاً من هرمونات السعادة، والأندروفين هو الأكثر شهرة بينها، حيث يندرج تحته 5 هرمونات: الدوبامين والسيروتونين والأوكسايتوسين والأستروجين والبروجسترون. وكل هذه الهرمونات تمنح الإحساس بالسعادة، وقد تعزِّز أطعمة عديدة إفراز هذه الهرمونات، منها الشوكولاتة والقهوة والسكريات والأطعمة السريعة، إلا أننا ننصح بتناول الأطعمة الصحية لتعزيز هذه الهرمونات، مثل السكريات الصحية الموجودة في الفواكه، والشوكولاتة الداكنة قليلة السكر. كما أن التمارين الرياضية أيضاً تحسّن المزاج وتحفز هرمونات السعادة، وهنالك دراسات تشير إلى أن الموسيقى أيضاً تساهم في إفراز هذه الهرمونات، وتوجد اليوم مراكز طبية لعلاج مرضى الأورام السرطانية بالموسيقى لتحسين حالتهم المزاجية.',",
    "Mindfulnessisatechniquethataimstofocuscompletelyonthepresentmoment.Meditationandrelaxationhelpreducestressandimproveconcentration.Bypracticingthesetechniques,apersoncanbecomemorebalancedandcomfortableintheirdailylife.'Ifyoufeelanxious,nervous,andtenseduetostress,youcantrypracticingmeditation.Spendingafewminutesmeditatingcanhelpyouregainasenseofcalmandinnerpeace.'Youcanpracticemeditationwhereveryouare,whetherwhilewalkingoutside,ridingthebus,waitingforyourappointmentatthedoctor'soffice,orevenduringaworkmeeting.Meditationcangiveyouasenseofcalm,peace,andbalance,whichcanbenefityourmentalandoverallhealth.Youcanalsouseittofeelrelaxedandmanagestressbyfocusingonsomethingthatcalmsyou.Meditationmayhelpyoulearnhowtomaintainfocusandinnerpeace.": " 'اليقظة الذهنية هي تقنية تهدف إلى التركيز الكامل على اللحظة الحالية. التأمل والاسترخاء يساعدان على تقليل التوتر وتحسين التركيز. من خلال ممارسة هذه التقنيات يمكن أن يصبح الشخص أكثر توازنًا وراحة في حياته اليومية. \\n'\n                      'إذا كنت تشعر بالقلق والعصبية والتوتر بسبب الضغط العصبي، يمكنك تجربة ممارسة التأمل. فقضاء بضع دقائق في التأمل يمكن أن يساعدك على استعادة الشعور بالهدوء والسلام الداخلي.\\n'\n                      'يمكنك ممارسة التأمل أينما كنت، سواء أثناء المشي خارج المنزل أو ركوب الحافلة أو انتظار موعدك في عيادة الطبيب أو حتى أثناء اجتماع عمل.يمكن للتأمل أن يمنحك الشعور بالهدوء والسلام والتوازن، الذي يمكن أن يعود بالنفع على صحتك النفسية والعامة. يمكنك أيضًا الاستعانة به للشعور بالاسترخاء والتعامل مع التوتر من خلال التركيز على شيء يهدئك. فالتأمل قد يفيدك في تعلّم كيفية الحفاظ على التركيز والسلام الداخلي.',"
  },

  "psychologicaltests": {
    "Notestsareavailable.": "لا توجد اختبارات متاحة",
    "Testwithoutaname.": "اختبار بدون اسم",
    "Nodescription.": "لا يوجد وصف",
    "Testdetails.": "تفاصيل الاختبار",
    "Nodataforthetest.": "لا توجد بيانات للاختبار",
    "Noquestionsareavailableforthistest.": "لا توجد أسئلة متاحة لهذا الاختبار.",
    "Invaliddataformat!": "تنسيق بيانات غير صحيح!",
    "⚠Incompletequestionorcontainsincorrectdata!": "⚠ سؤال غير مكتمل أو يحتوي على بيانات غير صحيحة!",
    "Unavailablequestion.": "سؤال غير متوفر",
    "Question": "السؤال",
    "Answer": "الإجابة",
    "Value": "القيمة",
    "Finaltotalpoints": "المجموع النهائي للنقاط:",
    "TestResult": "نتيجة الاختبار",
    "Okay": "حسناً",
    "AnxietyLevel:High.Werecommendyoubookanappointmentwithamentalhealthprofessional.": "مستوى القلق: مرتفع. نوصيك بحجز موعد مع مختص نفسي.",
    "AnxietyLevel:Moderate.Tryrelaxationexercisesandmeditationtechniques.": "مستوى القلق: متوسط. جرب تمارين الاسترخاء وتقنيات التأمل.",
    "AnxietyLevel:Low.Goodjobmanagingyouremotions!": "مستوى القلق: منخفض. أحسنت في إدارة مشاعرك!"
  },

  "Recommendationdetails": "تفاصيل التوصية",

  "reportsscreen": {
    "ProgressSummary": "ملخص التقدم",
    "Youhaveregistered": "لقد سجلت ",
    "Meditationsessionsthismonth": "جلسات تأمل هذا الشهر، و",
    "Journalingsessions": "جلسات كتابة يومياتك، و",
    "Psychologicalsupportsessions": "جلسات دعم نفسي، و",
    "Exercisesessions": "جلسات رياضية",
    "Analysisofyourdata": "تحليل بياناتك",
    "Yourgoals": "أهدافك",
    "PersonalizedRecommendations": "توصيات مخصصة",
    "ViewDetails": "عرض التفاصيل",
    "ViewMore": "عرض المزيد ",
    "Werecommendyoupracticeadeepbreathingexerciseaftereachmeditationsession.": "نوصيك بممارسة تمرين التنفس العميق بعد كل جلسة تأمل.",
    "Stardocumentingyourfeelingsdailytobecomemoreawareofyouremotionaldevelopments.": "ابدأ بتوثيق مشاعرك بشكل يومي لتصبح أكثر وعيًا بتطوراتك العاطفية.",
    "Werecommendyouhaveanadditionalmentalhealthsupportsessionthismonthtoenhanceyourdevelopment.": "ننصحك بإجراء جلسة دعم نفسي إضافية هذا الشهر لتعزيز تطورك.",
    "Increasethedurationofyourworkoutsforbestresults.": "قم بزيادة مدة تمرينات الرياضة لتحقيق أفضل النتائج.",
    "Trackyourprogressandstayontrack!": "تابع تقدمك وابق على المسار الصحيح!",
    "Practicedeepbreathingftermeditation": "ممارسة التنفس العميق بعد التأمل",
    "Deepbreathingpromotesrelaxationandreducesstresswonderfully!Trythesesimplestepsafterameditationsession:\\n": "التنفس العميق يعزز الاسترخاء ويقلل التوتر بشكل رائع! جرب هذه الخطوات البسيطة بعد جلسة التأمل:\n",
    "Steps:": "الخطوات:",
    "1.Closeyoureyesandbegindeepbreathing:inhalefor4seconds.\\n": "1. أغلق عينيك وابدأ بالتنفس العميق: استنشق الهواء لمدة 4 ثوانٍ.\n",
    "2.Holdyourbreathfor4seconds.\\n": "2. احبس النفس لمدة 4 ثوانٍ.\n",
    "3.Exhaleslowlyfor4seconds.\\n": "3. ازفر ببطء لمدة 4 ثوانٍ.\n",
    "4.Repeafor5minutesdaily,graduallyincreasingtheduration.\\n": "4. كرر لمدة 5 دقائق يوميًا، وزد المدة تدريجيًا.\n",
    "Benefits:": "الفوائد:",
    "Increasedmentalfocus.\\n": "- زيادة التركيز الذهني.\n",
    "Reducedstressaccumulate throughouttheday.\\n": "- تقليل التوتر المتراكم خلال اليوم.\n",
    "Writingfeelingsinajournal": "كتابة المشاعر في دفتر اليوميات",
    "Writtenexpressionisagreatwaytorelievestressandgainadeeperunderstandingofyourfeelings.": "التعبير الكتابي هو وسيلة رائعة للتخلص من التوتر وفهم مشاعرك بشكل أعمق.",
    "1.Setaside10minutesadaytowritefreelyandwithoutrestrictions.\\n": "1. خصص 10 دقائق يوميًا للكتابة بحرية ودون قيود.\n",
    "2.Focusonyourfeelings,notyourwritingstyle.\\n": "2. ركز على مشاعرك، وليس على أسلوب الكتابة.\n",
    "3.Readwhatyou'vewrittenandnoticehowyoufeelafterwards.\\n": "3. اقرأ ما كتبته ولاحظ كيف تشعر بعد ذلك.\n",
    "-Enhanceself-awareness.\\n": "- تعزيز الوعي الذاتي.\n",
    "-Reduceinternalstress.\\n": "- تقليل التوتر الداخلي.\n",
    "Trywritingatdifferenttimes(suchasmorningandevening)toseehowyourfeelingsevolvethroughouttheday.\\n": "جرب الكتابة في أوقات مختلفة (مثل الصباح والمساء) لرؤية تطور مشاعرك خلال اليوم.\n",
    "Conductregularpsychologicalsupportsessions.": "إجراء جلسات دعم نفسي منتظمة",
    "Psychologicalsupportopensnewdoorsforyoutounderstandyourselfanddealwithchallengesinahealthyway.\\n": "الدعم النفسي يفتح لك أبوابًا جديدة لفهم ذاتك والتعامل مع التحديات بشكل صحي.\n",
    "1.Scheduleweeklypsychologicalsupportsessions.\\n": "1. حدد موعدًا أسبوعيًا لجلسات الدعم النفسي.\n",
    "2.Preparetopicsthatyoufeelaffectyoutodiscusswithyourcounselor.\\n": "2. حضّر مواضيع تشعر أنها تؤثر عليك لمناقشتها مع المستشار.\n",
    "3.Recordyournotesandreviewyourprogressaftereachsession.\\n": "3. سجل ملاحظاتك وراجع تقدمك بعد كل جلسة.\n",
    "-Learnnewstrategiesforcopingwithstress.\\n": "- تعلم استراتيجيات جديدة للتعامل مع الضغوط.\n",
    "-Provideasafespacetoexpressyourfeelings.\\n": "- توفير مساحة آمنة للتعبير عن مشاعرك.\n",
    "Maketherapysessionsanongoinghabit,notapostponedoption.\\n": "اجعل الجلسات النفسية عادة مستمرة وليست خيارًا مؤجلًا.\n",
    "Exerciseregularly": "ممارسة الرياضة بانتظام",
    "Exerciseisnotonlyforimprovingfitness,butalsoforeffectivelyboostingyourmentalhealth.\\n": "الرياضة ليست فقط لتحسين اللياقة، بل أيضًا لتعزيز صحتك النفسية بشكل فعال.\n",
    "1.Chooseanactivityyouenjoy(walking,running,strengthtraining).\\n": "1. اختر نشاطًا تستمتع به (المشي، الجري، تمارين القوة).\n",
    "2.Maketimeforexerciseatleast3timesaweek.\\n": "2. خصص وقتًا للرياضة 3 مرات أسبوعيًا على الأقل.\n",
    "3.Makeitpartofyourdailyroutine.\\n": "3. اجعلها جزءًا من روتينك اليومي.\n",
    "-Improveyourmoodbyreleasinghappyhormones.\\n": "- تحسين المزاج عبر إفراز هرمونات السعادة.\n",
    "-Increaseyourenergyandfocusthroughouttheday.\\n": "- زيادة الطاقة والتركيز خلال اليوم.\n",
    "Startwithlightactivitiesandgraduallyincreaseyourlevel.Even15minutesadaycanmakeabigdifference!\\n": "ابدأ بأنشطة خفيفة، وزد المستوى تدريجيًا. حتى 15 دقيقة يوميًا تصنع فرقًا كبيرًا!\n",
    "Trackyourprogressonthesegoalstoachievebettermentalhealth!": "تابع تقدمك في هذه الأهداف لتحقيق صحة نفسية أفضل!"
  },

  "settingsscreen": {
    "notificationsenabled": "تم تفعيل الإشعارات",
    "notificationaaredisabled": "تم تعطيل الإشعارات",
    "notificationisenabled": "الإشعار مفعّل",
    "Notificationshavebeensuccessfullyactivated!": "تم تفعيل الإشعارات بنجاح!",
    "accountsettings": "إعدادات الحساب",
    "changeusername": "تغيير اسم المستخدم",
    "changepassword": "تغيير كلمة المرور",
    "notificationssettings": "إعدادات الإشعارات",
    "activatenotifications": "تفعيل الإشعارات",
    "customizenotifications": "تخصيص الإشعارات",
    "privacysettings": "إعدادات الخصوصية",
    "sharepaintingswithothers": "مشاركة الرسومات مع الآخرين",
    "graphicsharingenabled": "تم تفعيل مشاركة الرسومات",
    "graphicsharingdisabled": "تم تعطيل مشاركة الرسومات",
    "viewprivacypolicy": "عرض سياسة الخصوصية",
    "applicationsettings": "إعدادات التطبيق",
    "changethelanguage": "تغيير اللغة",
    "activatenightmode": "تفعيل الوضع الليلي",
    "nightmodeactivated": "تم تفعيل الوضع الليلي",
    "nightmodeisdisabled": "تم تعطيل الوضع الليلي",
    "clearchache": "مسح ذاكرة التخزين المؤقت",
    "supportandhelp": "الدعم والمساعدة",
    "FrequentlyAskedQuestions": "الأسئلة الشائعة",
    "answersonyourfrequentlyaskedouestions": "إجابات على أسئلتك الشائعة",
    "contacttechnicalsupport": "التواصل مع الدعم الفني",
    "directcontactwuththesupportteam": "تواصل مباشر مع فريق الدعم",
    "abouththeapplication": "حول التطبيق",
    "learnmoreabouththeapp": "تعرف على المزيد حول التطبيق",
    "arabic": "العربية",
    "chahcecleared": "تم مسح ذاكرة التخزين المؤقت",
    "Q:HowcanIusetheapp?A:Youcanstartusingitbyloggingin.": "س: كيف يمكنني استخدام التطبيق؟\\nج: يمكنك بدء الاستخدام بتسجيل الدخول",
    "Q:CanIchangemyaccountsettings?A:Yes,fromthesettingspage.": "س: هل يمكنني تغيير إعدادات الحساب؟\\nج: نعم، من صفحة الإعدادات.",
    "close": "إغلاق",
    "Tocontacttechnicalsupport,youcanemailusat:dinaelhallaq20@gmail.comorcall:0592153237": "للتواصل مع الدعم الفني، يمكنك مراسلتنا على: dinaelhallaq20@gmail.com أو الاتصال على: 0592153237",
    "helpfromtechnicalsupport": "مساعدة من الدعم الفني",
    "Ineedhelpwith...": "أحتاج إلى مساعدة بشأن...",
    "failedtoopenemail": "فشل في فتح البريد الإلكتروني",
    "mailcorrespondence": "مراسلة عبر البريد",
    "phonecall": "اتصال هاتفي",
    "Thisapplicationaimstoprovidepsychologicalandsocialsupportinaninnovativeway.": "هذا التطبيق يهدف إلى تقديم الدعم النفسي والاجتماعي بطريقة مبتكرة",
    "enterthenewusername": "أدخل اسم المستخدم الجديد",
    "cancel": "إلغاء",
    "usernamecannotbeempty": "اسم المستخدم لا يمكن أن يكون فارغًا",
    "usernamechanged": "تم تغيير اسم المستخدم",
    "save": "حفظ",
    "enterypurcurrentpassword": "أدخل كلمة المرور الحالية",
    "currentpassword": "كلمة المرور الحالية",
    "enternewpassword": "أدخل كلمة المرور الجديدة",
    "newpassword": "كلمة المرور الجديدة",
    "confirmnewpassword": "تأكيد كلمة المرور الجديدة",
    "confirmpassword": "تأكيد كلمة المرور ",
    "pleasefillinallfields": "يرجى ملء جميع الحقول.",
    "thenewpassworddonotmatch": "كلمات المرور الجديدة غير متطابقة.",
    "youarenotloggedin": "لم تقم بتسجيل الدخول",
    "changedpasswordsuccessfuly": "تم تغيير كلمة المرور بنجاح",
    "confirmsignout": "تأكيد تسجيل الخروج",
    "Areyousurethatyouwantsignout?": "هل أنت متأكد أنك تريد تسجيل الخروج؟"
  }
}
