{
  "@@locale": "en",
  "loginscreen": {
    "email": "email",
    "password": "password",
    "forgetyourpassword": "forget your password",
    "login": "Login",
    "youdonothaveanaccount": "you do not have an account",
    "registerasuser": "register as user",
    "registerasconsultant": "register as consultant",
    "registernow": "register now"
  },

  "resetpassword": "Reset password",
  "writeyouremailtoresetpassword": "write your email to reset password",
  "send": "send",
  "backtologinscreen": "back to login screen",
  "registeranewuser": "register a new user",
  "fullname": "full name",
  "confirmpassword": "confirm password",
  "youalreadyhaveanaccount": "you already have an account",
  "registration": "registration",
  "rafq": "rafq",
  "weareheretosupportyou": "we are here to support you",
  "drawyourfeeling": "draw your feeling",
  "ForumsandCommunities": "Forums and Communities",
  "Resourcesandarticles": "Resources and articles",
  "PsychologicalTestsSection": "sychologicalTestsSection",
  "Reportsandpersonalprogress": "Reports and personal progress",
  "signout": "sign out",
  "settings": "Settings",
  "hello": "hello",
  "Findthelightinthedark": "Find the light in the dark",
  "CounselingSessions": "CounselingSessions",
  "exercisesandstrategies": "exercises and strategies",
  "educationalresources": "educational resources",
  "supportgroups": "support groups",
  "moodtracking": "mood tracking",
  "Noadress": "No adress",
  "Therearenomessagesyet.": "There are no messages yet.",
  "areyousure?": "are you sure?",
  "doyouwanttosignoutfromapplication?": "do you want to sign out from application?",
  "no": "no",
  "yes": "yes",
  "choosethecolor": "choose the color",
  "cancel": "cancel",
  "done": "done",
  "downloadthepaint": "download the paint",
  "MentalHealthForum": "Mental Health Forum",
  "ForumDescription:Thisforumisfordiscussingmentalhealthtopicsingeneral.": "Forum Description: This forum is for discussing mental health topics in general.",
  "anxiety": "anxiety",
  "depression": "depression",
  "Unabletocaptureimagefromtheboard": "Unable to capture image from the board",
  "Thedrawinghasbeensavedwithintheapplication:": "The drawing has been saved within the application:",
  "❌Anerroroccurredwhile aving:": "❌An error occurred while saving:",
  "Anerroroccurredwhilesavingthedrawing!Tryagain.": "An error occurred while saving the drawing! Try again.",
  "Thedrawinghasbeensuccessfullydeleted!": "The drawing has been successfully deleted!",
  "❌Errorwhiledeleting:": "❌Error while deleting:",
  "Couldnotdeletedrawing!Tryagain.": "Could not delete drawing! Try again..",
  "Savethedrawing": "Save the drawing",
  "Therearenosaveddrawings": "There are no saved drawings",
  "Saveddrawing": "Saved drawing",
  "Therearenoforums": "There are no forums",
  "Noavaliableadress": "No avaliable adress",
  "Thereisnodetails": "There is no details",
  "makewrongwhenupdatethelikes": "make wrong when update the likes",
  "chatwithmembers": "chat with members",
  "Thereisnoanysharing": "There is no any share",
  "deletedsharingsuccessfully": "deleted sharing successfully",
  "Anerroroccurredwhiledeletingthepost": "An error occurred while deleting the post",
  "Postsuccessfullyposted": "Post successfully posted",
  "Descriptionofthetopic": "Description of the topic",
  "Pleasefilloutallfields": "Please fill out all fields",
  "addsharing": "add sharing",
  "Theadress": "The adress",
  "Thecontent": "The content",
  "addthesharing": "add the sharing",
  "Thechat": "The chat",
  "Thereisnomessageyet": "There is no message yet",
  "sendamessage": "send a message",
  "Practicemeditationfor10minutesdaily.": "Practice meditation for 10 minutes daily.",
  "Readabookaweek": "Read a book a week",
  "Writingyourfeelingsinyourjournal": "Writing your feelings in your journal",
  "Conductaweeklypsychologicalsupportsession": "Conduct a weekly psychological support session",
  "Exercise3timesaweek": "Exercise 3 times a week",
  "Setaside10minuteseachdayforbreathingormindfulnessmeditation.": "Set a side 10 minutes each day for breathing or mindfulness meditation",
  "Take10minutesadaytowritedownyourfeelingsandthoughtsinajournal.Thishabitcanhelpimproveyourmentalhealth..": "Take 10 minutes a day to write down your feelings and thoughts in a journal. This habit can help improve your mental health.",
  "Chooseabookandreadatleastonechapterperweektodeveloppersonalskills..": "Choose a book and read at least one chapter per week to develop personal skills",
  "Doexercisessuchaswalkingorjoggingfor30minutesatatime..": "Do exercises such as walking or jogging for 30 minutes at a time.",
  "Takeadeepbreath,closeyoureyes,andfocusonyourbreathingfor10minutes.youcanuseappslikeHeadspaceorCalm.": "Take a deep breath, close your eyes, and focus on your breathing for 10 minutes. You can use apps like Headspace or Calm.",
  "Writedowneverythingthatcomestomindinyourjournal,evenifyouthoughtsseemrandom.Thiswillhelyouregulateyouremotionsandreducestress.": "Write down everything that comes to mind in your journal, even if your thoughts seem random. This will help you regulate your emotions and reduce stress.",
  "Chooseabookthatinterestsyouandstartbyreadingonechapter.Trytosetasidetimeeachdayforthis.": "Choose a book that interests you and start by reading one chapter. Try to set aside time each day for this.",
  "Startwithaneasyrunorwalkfor5minutes,thengraduallyincreasethetimeeachweek.": "Start with an easy run or walk for 5 minutes, then gradually increase the time each week.",
  "Youhavecompletedthegoal!": "You have completed the goal!",
  "Howtodothegoal:": "How to do the goal:",
  "Yourprogress:": "Your progress:",
  "Completethegoal": "Complete the goal",
  "Currentstep:" : "Current step:",
  "logoutpage": {
    "signout": "sign out",
    "confirmlogout": "confirm logout",
    "Areyousurethatyouwanttologout?": "Are you sure that you want to logout",
    "Anerroroccurredwhileloggingout": "An error occurred while logging out"
  },
  "notificationsettingspage": {
    "customizenotifications": "customize notifications",
    "messagenotifications": "message notifications",
    "activitynotifications": "activity notifications"
  },
  "Settings": "Settings",
  "invalid_options_format": "invalid_options_format",
  "AnxietyandStress": "Anxiety and Stress",
  "Depression": "Depression",
  "SleepDisorders": "Sleep Disorders",
  "StressManagement": "Stress Management",
  "SocialRelationships": "Social Relationships",
  "Self-EsteemandSelf-Confidence": "Self-Esteem and Self-Confidence",
  "MentalHealthofChildrenandAdolescents": "Mental Health of Children and Adolescents",
  "MentalHealthoftheElderly": "Mental Health of the Elderly",
  "TraumaandRecovery": "Trauma and Recovery",
  "NutritionandMentalHealth": "Nutrition and Mental Health",
  "Mindfulness,Meditation,Relaxation": "Mindfulness, Meditation, Relaxation",
  "HowtoDealwithAnxiety": "How to Deal with Anxiety",
  "PracticalTipsforDealingwithAnxietyandDailStress.": "Practical Tips for Dealing with Anxiety and Daily Stress.",
  "TheImportanceofGoodSleeforMentalHealth": "The Importance of Good Sleep for Mental Health",
  "HowGoodSleepAffectsOuMentalHealth.": "How Good Sleep Affects Our Mental Health.",
  "1.Practicepositivethinking'2.Usejournalingtoreleaseyourfeelings3.Tryrationality4.Calmthenervoussystemusingdiaphragmaticbreathing(deepbreathing)5.Overcomefearbygentlytalkingyourselfoutofit.": "1. Practice positive thinking '2. Use journaling to release your feelings\\n'\\n '3. Try rationality\\n'\\n '4. Calm the nervous system using diaphragmatic breathing (deep breathing).\\n'\\n '5. Overcome fear by gently talking yourself out of it.",
  "'*Hoursofsleepareveryimportantinthelifeofanyhumanbeingfromthemomentofbirth.In fact,sleepisessentialforthepropergrowthanddevelopmentofchildrenandinfantsandtheirphysicalandpsychologicaldevelopment.**Inadults,thequalityofsleepdirectlyaffectstheirnormalactivities,asrestandmusclerelaxationoccurduringsleep,andbreathingratedecreases.Furthermore,sleepislinkedtomood,withpsychologicaldisorderssuchasanxietyordepressionbeingmorecommoninpeoplewithpoorsleepquality.*Sleepisinfluencedbytwomainhormones:cortisolandmelatonin.Theformeristhestresshormoneandisconcentratedinthebloodduringtheearlymorninghours,makingpeoplefeelalert.However,melatoninisthesleephormoneanditsconcentrationincreasesatnight,makingpeoplefeelrelaxed.Thishormonalbalanceisessentialforpeopletogetgoodsleep.": "'* Hours of sleep are very important in the life of any human being from the moment of birth. In fact, sleep is essential for the proper growth and development of children and infants and their physical and psychological development.\\n '\\n '** In adults, the quality of sleep directly affects their normal activities, as rest and muscle relaxation occur during sleep, and breathing rate decreases. Furthermore, sleep is linked to mood, with psychological disorders such as anxiety or depression being more common in people with poor sleep quality.* Sleep is influenced by two main hormones: cortisol and melatonin. The former is the stress hormone and is concentrated in the blood during the early morning hours, making people feel alert. However, melatonin is the sleep hormone and its concentration increases at night, making people feel relaxed. This hormonal balance is essential for people to get good sleep.",
  "ArticleCategories": "Article Categories",
  "RecommendedArticles": "Recommended Articles",
  "anxietyAndStress": "Anxiety and stress are among the most common psychological conditions. Anxiety can occur due to fear of the future or unfamiliar situations. In contrast, stress results from the pressures of daily life. It is important to learn relaxation techniques such as deep breathing, yoga, or meditation to reduce symptoms.\n\nStress is a natural part of life and may arise from environmental, physical, or mental factors. Stress does not necessarily have to be negative; in fact, positive changes in life such as receiving a promotion or the birth of a child can also lead to psychological stress.\n\nAnxiety disorders, like other mental health conditions, are the result of a complex interplay between social, psychological, and biological factors. While anyone can develop an anxiety disorder, those who have experienced abuse, significant losses, or other negative experiences are more susceptible to these conditions.\n\nSelf-care can play an important role in supportive treatment. To help manage your anxiety symptoms and improve your overall mental well-being, you can follow these guidelines:\n\n * Avoid or reduce alcohol consumption and refrain from using illicit drugs that may exacerbate anxiety;\n * Engage in regular physical exercise, even if it is just a short walk;\n * Develop a habit of mindfulness meditation, even if only for a few minutes each day.",
  "depressionisamentalcondition": "Depression is a mental condition characterized by deep sadness and a loss of interest in activities. It may lead to a decline in daily performance and difficulty in interacting with the surrounding environment. Treatment involves psychotherapy, medications, and lifestyle changes such as regular exercise and proper sleep.\n\nA person experiencing a depressive episode often endures a low mood—characterized by persistent sadness, irritability, and a sense of emptiness—and may lose interest or pleasure in activities.\n\nA depressive episode differs from typical mood fluctuations as it usually lasts most of the day, nearly every day, for at least two weeks.\n\nAdditional symptoms of depression include:\n\n1. Difficulty concentrating\n2. Excessive feelings of guilt or low self-esteem\n3. Changes in appetite or weight\n\n* Self-care can play an important role in managing depressive symptoms and enhancing overall well-being. Some suggestions include:\n\n * Trying to continue engaging in activities you once enjoyed\n * Maintaining regular eating and sleeping habits as much as possible\n * Speaking with someone you trust about your feelings",
  "sleep_disorders": "Sleep disorders are issues that affect the quality of sleep. Symptoms include difficulty falling asleep or frequent awakenings during the night. To address sleep disorders, it is important to follow a regular sleep schedule, avoid stimulants before bedtime, and stay away from screens in the evening.\n\nSleep disorders can impact your overall health, safety, and quality of life. Insufficient sleep at night may impair your ability to drive or work safely and can increase your risk of other health problems. Proper treatment can help you achieve the amount of sleep you need.\n\nCommon symptoms of sleep disorders include:\n\n1. Extreme sleepiness during the day, potentially causing you to fall asleep at inappropriate times, such as while driving or at work\n\n2. Abnormal breathing patterns during sleep, which may involve gasping, snoring, or episodes of inhaling, choking, or temporary pauses in breathing\n\n3. Excessive movement during sleep, such as restless arm or leg movements or teeth grinding\n\nSituations that warrant consultation with a doctor include persistent difficulties in getting enough sleep, not feeling rested upon waking, or experiencing excessive daytime sleepiness.",
  "stress_management": "Stress management is a fundamental skill for maintaining mental health. Techniques such as deep breathing, regular exercise, allocating time for relaxation, and effective time management can help reduce daily stress and improve overall well-being.\n\nThe early signs of stress include:\n\n1. Emotional reactivity\n2. Sleep disturbances\n\nTips for alleviating stress through self-help:\n\nShort periods of stress are natural and can often be resolved with simple actions, such as completing a task (thereby reducing workload) or by talking to others and taking time to relax. One or more of the following suggestions may help:\n\n• Assess your life to determine exactly what is causing your anxiety. For example, are you worried about exams, finances, or relationship issues? See if you can change your circumstances to alleviate the pressure.\n\n• Learn relaxation techniques. If you experience a panic attack or high stress, try focusing on something external, watching television, or talking to someone. Relaxation and breathing exercises can be beneficial.\n\n• Address personal issues by talking to a friend, a teacher, or a family member.",
  "Goodsocialrelationships": "Good social relationships are essential for mental health. Strengthening relationships with friends and family, maintaining open communication, and supporting one another can reduce stress and enhance a sense of belonging.\n\nGood social relationships provide numerous benefits, including:\n\n1. Reducing the risk of anxiety and depression\n2. Enhancing self-efficacy\n3. Improving empathy among individuals\n4. Strengthening trust and cooperative bonds",
  "Self-esteemandself-confidence": "Self-esteem and self-confidence are the foundation for personal success and mental health. Building self-confidence requires working on strengthening one's skills, maintaining positive thinking, and taking care of oneself.\n\nSelf-confidence and self-esteem are very important in an individual's psychological and social life. Their significance is highlighted as follows:\n\n* Achieving psychological harmony\n* Gaining experiences\n* Succeeding at work\n* Gaining society's affection\n* Facing challenges\n\nSelf-confidence and self-esteem are among the most important personal traits one should possess, as they pave the way for self-success and social harmony. However, many obstacles can affect an individual's level of confidence and self-esteem, including:\n\n* Health obstacles\n* Emotional obstacles\n* Mental obstacles\n* Economic obstacles",
  "Thementalhealthofchildrenandadolescents": "The mental health of children and adolescents requires special attention. It is important to create a safe and supportive environment for them and provide educational resources to help them manage their emotions. Treatment may include psychological support and family guidance.\n\nGood mental health is considered one of the most important factors for healthy growth and balance in all children. Their psychological well-being is essential for building good relationships with others and plays a major role in their ability to handle challenges. Its importance is evident in several aspects, including:\n\n1. It makes them feel satisfied with themselves and boosts self-confidence.\n2. It enables them to enjoy their lives and reduces negative energy.\n3. It helps them learn and fosters their sense of creativity.\n4. It strengthens family bonds and builds their relationships in a healthy way.\n5. It improves their ability to handle sad emotions and reduces stress.\n6. It enhances their capacity to recover from difficult times and regain their sense of self.\n7. It increases their willingness to try new things and enhances their ability to understand what is happening around them.",
  "Thementalhealthofolderpeople\"stress_management\"": "The mental health of older people requires special care. Some elderly individuals experience loneliness, depression, or anxiety. Social support, guided activities, and medical care can improve their mental well-being.\\n'\n                  'Strategies to promote mental health and prevent disorders among older adults focus on supporting healthy aging. This means creating physical and social environments that support well-being and enable individuals to perform tasks they find meaningful, despite declining abilities.\\n'\n                  'Key strategies to enhance mental health and well-being in older adults include:\\n'\n                   '1. Measures to reduce financial insecurity and income inequality.\\n'\n                   '2. Programs ensuring safe and accessible housing, public buildings, and transportation.\\n'\n                   '3. Social support for older people and their caregivers.\\n'\n                   '4. Promoting healthy behaviors, particularly maintaining a balanced diet, engaging in physical activity, avoiding tobacco use, and limiting alcohol consumption.\\n'\n                   '5. Health and social programs targeting vulnerable groups, such as those living alone, in remote areas, or suffering from chronic health conditions.\\n'\n                   'Early identification and treatment of mental health conditions (along with related neurological and substance use disorders) in older people is crucial. The Integrated Care for Older People (ICOPE) guidelines emphasize community-based care, focusing on long-term support for older individuals with mental health conditions and functional decline, as well as raising awareness, training, and supporting caregivers. A combination of psychological interventions and other support mechanisms is often recommended to meet health, personal, and social needs.'",  "Psychologicaltraumacangreatlyaffectaperson.Itcanincludetraumafromthepastordifficultsituations.Treatmentandrecoveryfromtraumarequiresongoingpsychologicalsupportandguidancetodealwithnegativefeelings throughpsychotherapy.'Whenpeopleexperiencetrauma,theyareoverwhelmedbyfeelingsofsadness,anger,andperhapsdenialandself-blame.Overtime,manypeoplecanadaptandovercomethenegativeeffects,especiallywiththenecessarysupportWhilesymptomsmaypersistinsomecases,thepersonmayfeelstuckinthisevent,constantlyrelivingthepainfulexperienceandthenegativefeelingsthataccompanyit.Theymayalsoavoidanythingorplacethat mightremindthemofit,whichindicatesthepossibilityofdevelopingapsychologicaldisordercalledpost-traumaticstressdisorder.'Typesofpsychologicaltraumaincludethefollowing:'1.Acutetrauma'2.Chronictrauma'3.Complextrauma'4.Secondarytrauma'TreatmentofpsychologicaltraumadependsonSymptomsthepatientissufferingfrom,andaimstoreducetheimpactofthetraumaontheperson,andtreattheconditionsresultingfromit,suchasanxiety,depression,orpost-traumaticstressdisorder.'Psychotherapyisthefirststepintreatingcasesofpsychologicaltrauma,andthetreatmentmethodsusedincludethefollowing:'*Cognitivebehavioraltherapy'*Eyemovementdesensitizationandreprocessing \\n": "'الصدمات النفسية يمكن أن تؤثر بشكل كبير على الشخص. يمكن أن تشمل صدمات من الماضي أو مواقف صعبة. العلاج والتعافي من الصدمات يتطلب دعم نفسي مستمر، وتوجيه للتعامل مع المشاعر السلبية من خلال العلاج النفسي. \\n'\n                  'يسيطر على الأشخاص عند تعرضهم لصدمة ما شعور بالحزن، والغضب، وربما الإنكار ولوم النفس، وبمرور الوقت يستطيع العديد من الأشخاص التأقلم والتغلب على الآثار السلبية خاصة مع تلقي الدعم اللازم. بينما قد تستمر الأعراض في بعض الحالات فيشعر الشخص بأنه عالق في هذا الحدث فيظل يسترجع أحداث التجربة المؤلمة وما يصاحبها من مشاعر سلبية، كما يحرص على تجنب أي شيء أو مكان قد يذكره بذلك، وهو ما يشير إلى احتمالية الإصابة باضطراب نفسي يطلق عليه اضطراب ما بعد الصدمة\\n'\n                  'تشمل أنواع الصدمة النفسية ما يلي \\n'\n                  '1. الصدمه الحاده\\n'\n                  '2. الصدمه المزمنه\\n'\n                  '3. الصدمه المعقده \\n'\n                  '4. الصدمه الثانويه \\n'\n                  'يعتمد علاج الصدمة النفسية على الأعراض التي يعاني منها المريض، ويهدف إلى تخفيف وقع الصدمة على الشخص، وعلاج الحالات التي تنجم عنها، مثل القلق والاكتئاب، أو اضطراب ما بعد الصدمة. \\n'\n                   'يعد العلاج النفسي هو الخطوة الأولى في معالجة حالات الصدمة النفسية، وتشمل أساليب العلاج المتبعة ما يلي: \\n'\n                   '* العلاج السلوكي المعرفي \\n'\n                   '* ازاله التحسس واعاده المعالجه عن طريق حركه العين \\n',",
  "Goodnutritionandmentalhealth": "Good nutrition plays a fundamental role in mental health. Eating a balanced diet helps improve mood and the ability to cope with stress. Foods rich in omega-3, vitamins, and nutrients can support mental health.\n\nRegarding physical activity and its relationship to mental health, Hilal said: 'Exercise is an important healthy habit that enhances the secretion of happiness hormones in the body. If a person gets used to exercise and makes it a lifestyle, it helps them regulate eating and gives them a sense of satisfaction and accomplishment. Numerous studies have indicated that regular exercise may help people with depression reduce their medication doses. Team sports such as football are very beneficial for children, as they enhance their self-confidence and self-esteem and help build their personalities.'\n\nSpecialist Nadine Hilal pointed out that there are 20 types of happiness hormones, and endorphins are the most famous among them. These include five key hormones: dopamine, serotonin, oxytocin, estrogen, and progesterone. All of these hormones contribute to a sense of happiness. Many foods can boost the secretion of these hormones, including chocolate, coffee, sugars, and fast food. However, we recommend eating healthy foods to boost these hormones, such as natural sugars found in fruits and low-sugar dark chocolate.\n\nExercise also improves mood and stimulates happiness hormones. There are studies indicating that music also contributes to the secretion of these hormones. Today, there are medical centers that use music therapy to improve the mood of cancer patients.",
  "Mindfulnessisatechniquethataimstofocuscompletelyonthepresentmoment.Meditationandrelaxationhelpreducestressandimproveconcentration.Bypracticingthesetechniques,apersoncanbecomemorebalancedandcomfortableintheirdailylife.'Ifyoufeelanxious,nervous,andtenseduetostress,youcantrypracticingmeditation.Spendingafewminutesmeditatingcanhelpyouregainasenseofcalmandinnerpeace.'Youcanpracticemeditationwhereveryouare,whetherwhilewalkingoutside,ridingthebus,waitingforyourappointmentatthedoctor'soffice,orevenduringaworkmeeting.Meditationcangiveyouasenseofcalm,peace,andbalance,whichcanbenefityourmentalandoverallhealth.Youcanalsouseittofeelrelaxedandmanagestressbyfocusingonsomethingthatcalmsyou.Meditationmayhelpyoulearnhowtomaintainfocusandinnerpeace.":   "Mind fulnessisa technique that aims to focus completely on the present moment.Meditation and relaxation help reduce stress and improve concentration.By practicing these techniques,aperson can become more balanced and comfortable in their daily life.'If you feel anxious,nervous,and tense dueto stress,you can try practicing meditation.Spending a few minutes meditating can help your again a sense of calm and inner peace.'You can practice meditation where very ou are,whether while walking out side,riding the bus,waiting for your appointment at the doctor 'office,or even during a work meeting.Meditation can give you a sense of calm,peace,and balance,which can benefit your mental andover all health.You can also use it to feel relaxed and manage stress by focusing on something that calms you.Meditation may help you learn how to maintain focus and inner peace.",
  "Psychologicaltraumacangreatlyaffectaperson.Itcanincludetraumafromthepastordifficultsituations.Treatmentandrecoveryfromtraumarequiresongoingpsychologicalsupportandguidancetodealwithnegativefeelings throughpsychotherapy.": "Psychological trauma can greatly affect a person. It may include trauma from the past or difficult situations. Treatment and recovery from trauma require ongoing psychological support and guidance to manage negative emotions through psychotherapy.\\n'\n                  'When people experience a traumatic event, they may feel overwhelmed by sadness, anger, denial, or self-blame. Over time, many individuals adapt and overcome the negative effects, especially with adequate support. However, some may continue to experience symptoms, making them feel stuck in their past experiences, reliving painful memories, and struggling with persistent negative emotions, while avoiding anything that reminds them of the trauma. This could indicate post-traumatic stress disorder (PTSD).\\n'\n                  'Types of psychological trauma include:\\n'\n                   '1. Acute trauma\\n'\n                   '2. Chronic trauma\\n'\n                   '3. Complex trauma\\n'\n                   '4. Secondary trauma\\n'\n                   'The treatment of psychological trauma depends on the symptoms experienced by the individual. It aims to reduce the impact of trauma and address related conditions such as anxiety, depression, or PTSD.\\n'\n                   'Psychotherapy is the primary approach in treating trauma-related conditions, and common treatment methods include:\\n'\n                   '* Cognitive Behavioral Therapy (CBT)\\n'\n                   '* Eye Movement Desensitization and Reprocessing (EMDR)\\n'",
  "Notestsareavailable.": "No tests are available",
  "Testwithoutaname.": "Test without a name",
  "Nodescription.": "No description",
  "Testdetails.": "Test details",
  "Nodataforthetest.": "No data for the test",
  "Noquestionsareavailableforthistest.": "No questions are available for this test.",
  "Invaliddataformat!": "Invalid data format!",
  "⚠Incompletequestionorcontainsincorrectdata!": "⚠Incomplete question or contains incorrect data!",
  "Unavailablequestion.": "Unavailable question",
  "Question": "Question",
  "Answer": "Answer",
  "Value": "Value",
  "TestResult": "Test Result",
  "Okay": "Okay",
  "AnxietyLevel:High.Werecommendyoubookanappointmentwithamentalhealthprofessional.": "Anxiety Level:High.We recommend you book an appointment with amental health professional.",
  "AnxietyLevel:Moderate.Tryrelaxationexercisesandmeditationtechniques.": "Anxiety Level:Moderate.Try relaxation exercises an dmeditation techniques.",
  "AnxietyLevel:Low.Goodjobmanagingyouremotions!": "Anxiety Level:Low.Good job managing your emotions!",
  "ProgressSummary": "Progress Summary",
  "Youhaveregistered": "You have registered",
  "Meditationsessionsthismonth": "Meditation sessions this month",
  "Journalingsessions": "Journaling sessions",
  "Psychologicalsupportsessions": "Psychological support sessions",
  "Exercisesessions": "Exercise sessions",
  "Analysisofyourdata": "Analysis of your data",
  "Yourgoals": "Your goals",
  "PersonalizedRecommendations": "Personalized Recommendations",
  "ViewDetails": "View Details",
  "ViewMore": "View More",
  "Werecommendyoupracticeadeepbreathingexerciseaftereachmeditationsession.": "We recommend you practice adeep breathing exercise after eachmeditation session",
  "Stardocumentingyourfeelingsdailytobecomemoreawareofyouremotionaldevelopments.": "Start documenting your feelings daily to become more aware of your emotional developments",
  "Werecommendyouhaveanadditionalmentalhealthsupportsessionthismonthtoenhanceyourdevelopment.": "We recommend you have an additional mental health support session this month to enhance your development",
  "Increasethedurationofyourworkoutsforbestresults.": "Increase the duration of your workouts for best results",
  "Trackyourprogressanvoid main() async {\n  WidgetsFlutterBinding.ensureInitialized();\n  await EasyLocalization.ensureInitialized();\n  await Firebase.initializeApp(options: DefaultFirebaseOptions.currentPlatform);\n  await FirebaseAppCheck.instance.activate(\n    androidProvider: AndroidProvider.debug,\n  );\n  FirebaseAuth.instance.setLanguageCode('ar');\n  FirebaseMessaging.onBackgroundMessage(_firebaseMessagingBackgroundHandler);\n  runApp(\n    EasyLocalization(\n      supportedLocales: [Locale('ar'), Locale('en')],\n      path: 'assets/translations',\n      fallbackLocale: Locale('ar'),\n      child: MultiProvider(\n        providers: [\n          ChangeNotifierProvider(create: (_) => DarkModeProvider()),\n          // يمكنك إضافة مزودين آخرين هنا إذا لزم الأمر\n        ],\n        child: MyApp(),\n      ),\n    ),\n  );\n}\ndstayontrack!": "Track your progress and stay on track!",
  "Practicedeepbreathingftermeditation": "Practice deep breathing after meditation",
  "Deepbreathingpromotesrelaxationandreducesstresswonderfully!Trythesesimplestepsafterameditationsession": "Deep breathing promotes relaxation and reduces stress wonderfully!Try these simple steps after a meditation session",
  "Steps:": "Steps:",
  "1.Closeyoureyesandbegindeepbreathing:inhalefor4seconds.": "1.Close your eyes and begin deep breathing:in hale for 4 seconds.",
  "2.Holdyourbreathfor4seconds.": "2.Hold your breath for 4 seconds.",
  "3.Exhaleslowlyfor4seconds.": "3.Exhale slowly for 4 seconds.",
  "4.Repearfor5minutesdaily,graduallyincreasingtheduration.": "4.Repear for 5 minutes daily,gradually increasing the duration.",
  "Benefits:": "Benefits:",
  "Increasedmentalfocus": "Increased mental focus",
  "Reducedstressaccumulatethroughouttheday.": "Reduce stress accumulate throughout the day."
}
